---
kind: property
id: P:Autodesk.Revit.DB.TextNode.IsItalic
source: html/ba189cc6-b16d-bb58-242b-4ef2891f41a7.htm
---
# Autodesk.Revit.DB.TextNode.IsItalic Property

Indicates whether the default formatting is set to italic text.

## Syntax (C#)
```csharp
public bool IsItalic { get; }
```